app/Models/keranjang.php

SELECT COUNT(*) AS `numrows` FROM `beli`
---
    public function jumlah()
    {
        return $this->db->table('beli')->countAll();