app/Models/produkmodel.php

    public function getProduk($id = false)
    {
        if($id==false){
            return $this->findAll();
---
SELECT *
FROM `produk`